# 09. 데이터 병합하기(join)

In [1]:
# pd.merge(left = 데이터프레임명1,
#          right = 데이터프레임명2,
#          left_on="데이터프레임1 조인키",
#          right_on = "데이터프레임2 조인키",
#          how="조인방법") ex) inner, left, right, outer

In [2]:
# 조인방법
# INNER JOIN(교집합) : 자료의 공통 속성인 조인키를 정의한 후 키를 기준으로 추가 속성자료 붙임(서로 키 값이 있는 경우만 조인)
# LEFT JOIN : 기준이 되는 데이터는 무조건 살린다
# RIGHT JOIN : 붙이는 데이터는 무조건 살린다
# OUTER JOIN : 기준이 되는 데이터와 붙이는 데이터 둘 다 살린다

In [3]:
# cf) left_on과 right_on에 명시만 해준다면 컬럼명이 달라도 조인 가능

In [4]:
import pandas as pd

In [5]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")
joinSellout.head()

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [6]:
# CSV 파일을 읽어 Data Frame 변수에 저장하기
joinMaster = pd.read_csv("../dataset/join_region_master.csv", encoding = "ms949") 
joinMaster.head()

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

# INNER JOIN(교집합)

In [7]:
# : 자료의 공통 속성인 조인키를 정의한 후 키를 기준으로 추가 속성자료 붙임(서로 키 값이 있는 경우만 조인)

In [8]:
# 예제 1

In [9]:
mergeResult = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="inner")
mergeResult.head()

  REGIONID PRODUCT  YEARWEEK   QTY REGIONNAME
0      A01  ST0001    201901  3000         한국
1      A01  ST0001    201902  3500         한국
2      A02  ST0002    201901  4000         미국
3      A02  ST0003    201902  7000         미국

In [10]:
# 예제 2
# 컬럼의 이름이 달라도 조인이 가능하다(속성값들이 같으면 조인이 가능하다)

In [11]:
joinSellout = joinSellout.rename(columns={"REGIONID":"SALESID"})
joinSellout.head()

  SALESID PRODUCT  YEARWEEK   QTY
0     A01  ST0001    201901  3000
1     A01  ST0001    201902  3500
2     A02  ST0002    201901  4000
3     A02  ST0003    201902  7000

In [12]:
mergeResult = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="SALESID",
                       right_on = "REGIONID",
                       how="inner")
mergeResult.head()

  SALESID PRODUCT  YEARWEEK   QTY REGIONID REGIONNAME
0     A01  ST0001    201901  3000      A01         한국
1     A01  ST0001    201902  3500      A01         한국
2     A02  ST0002    201901  4000      A02         미국
3     A02  ST0003    201902  7000      A02         미국

In [13]:
mergeResult[["SALESID","REGIONID","REGIONNAME","PRODUCT","YEARWEEK", "QTY"]] # 필요한 컬럼만 조회

  SALESID REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0     A01      A01         한국  ST0001    201901  3000
1     A01      A01         한국  ST0001    201902  3500
2     A02      A02         미국  ST0002    201901  4000
3     A02      A02         미국  ST0003    201902  7000

In [14]:
mergeResult.loc[ : , ["SALESID","REGIONID","REGIONNAME","PRODUCT","YEARWEEK", "QTY"] ] # 필요한 컬럼만 조회

  SALESID REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0     A01      A01         한국  ST0001    201901  3000
1     A01      A01         한국  ST0001    201902  3500
2     A02      A02         미국  ST0002    201901  4000
3     A02      A02         미국  ST0003    201902  7000

# LEFT JOIN

In [15]:
# : 기준이 되는 데이터는 무조건 살린다

In [16]:
# 예제1

In [17]:
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")

In [18]:
testDf = pd.DataFrame( [[ "A01", "미국" ]], columns=["SALESID", "SALESNAME"])
# cf) left_on과 right_on에 명시만 해준다면 컬럼명이 달라도 조인 가능
testDf

  SALESID SALESNAME
0     A01        미국

In [19]:
mergeResult2 = pd.merge(left = joinSellout,
                       right = testDf,
                       left_on="REGIONID",
                       right_on = "SALESID",
                       how="left")

In [20]:
mergeResult2

  REGIONID PRODUCT  YEARWEEK   QTY SALESID SALESNAME
0      A01  ST0001    201901  3000     A01        미국
1      A01  ST0001    201902  3500     A01        미국
2      A02  ST0002    201901  4000     NaN       NaN
3      A02  ST0003    201902  7000     NaN       NaN

# RIGHT JOIN

In [21]:
# : 붙이는 데이터는 무조건 살린다

In [22]:
mergeResult3 = pd.merge(left = joinSellout,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="right")

In [23]:
mergeResult3

  REGIONID PRODUCT  YEARWEEK     QTY REGIONNAME
0      A01  ST0001  201901.0  3000.0         한국
1      A01  ST0001  201902.0  3500.0         한국
2      A02  ST0002  201901.0  4000.0         미국
3      A02  ST0003  201902.0  7000.0         미국
4      A03     NaN       NaN     NaN        프랑스
5      A04     NaN       NaN     NaN         독일

# OUTER JOIN

In [24]:
# : 기준이 되는 데이터와 붙이는 데이터 둘 다 살린다

In [25]:
# step.1 concat 사용해서 새로운 testDf 만들기

In [26]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [27]:
testDf = pd.DataFrame( [[ "A10", "ST0009","201903", 5000 ]], columns=["REGIONID", "PRODUCT", "YEARWEEK", "QTY"])
testDf

  REGIONID PRODUCT YEARWEEK   QTY
0      A10  ST0009   201903  5000

In [28]:
testDf2 = pd.concat( [joinSellout, testDf] , axis = 0)
testDf2

  REGIONID PRODUCT YEARWEEK   QTY
0      A01  ST0001   201901  3000
1      A01  ST0001   201902  3500
2      A02  ST0002   201901  4000
3      A02  ST0003   201902  7000
0      A10  ST0009   201903  5000

In [29]:
mergeResult4 = pd.merge(left = testDf2,
                       right = joinMaster,
                       left_on="REGIONID",
                       right_on = "REGIONID",
                       how="outer")

In [30]:
mergeResult4

  REGIONID PRODUCT YEARWEEK     QTY REGIONNAME
0      A01  ST0001   201901  3000.0         한국
1      A01  ST0001   201902  3500.0         한국
2      A02  ST0002   201901  4000.0         미국
3      A02  ST0003   201902  7000.0         미국
4      A10  ST0009   201903  5000.0        NaN
5      A03     NaN      NaN     NaN        프랑스
6      A04     NaN      NaN     NaN         독일

# inner, left, right, outer 비교

In [31]:
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")
joinSellout.head()

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [32]:
row1 = ["A01", "ST0001", 0.3]
row2 = ["A02", "ST0002", 0.5]
row3 = ["A99", "ST0099", 0.9]

In [33]:
promoData = pd.DataFrame([row1, row2, row3], columns=["REGION", "PD", "PROMOTION"])
promoData

  REGION      PD  PROMOTION
0    A01  ST0001        0.3
1    A02  ST0002        0.5
2    A99  ST0099        0.9

## inner join

In [34]:
mergeResult = pd.merge(left = joinSellout,
                       right = promoData,
                       left_on=["REGIONID","PRODUCT"],
                       right_on = ["REGION", "PD"],
                       how="inner")
mergeResult # 교집합 영역이 아닌 데이터는 사라지게 된다.

  REGIONID PRODUCT  YEARWEEK   QTY REGION      PD  PROMOTION
0      A01  ST0001    201901  3000    A01  ST0001        0.3
1      A01  ST0001    201902  3500    A01  ST0001        0.3
2      A02  ST0002    201901  4000    A02  ST0002        0.5

## left join

In [35]:
mergeResult = pd.merge(left = joinSellout,
                       right = promoData,
                       left_on=["REGIONID","PRODUCT"],
                       right_on = ["REGION", "PD"],
                       how="left")
mergeResult # left 데이터는 무조건 살린다.

  REGIONID PRODUCT  YEARWEEK   QTY REGION      PD  PROMOTION
0      A01  ST0001    201901  3000    A01  ST0001        0.3
1      A01  ST0001    201902  3500    A01  ST0001        0.3
2      A02  ST0002    201901  4000    A02  ST0002        0.5
3      A02  ST0003    201902  7000    NaN     NaN        NaN

## right join

In [36]:
mergeResult = pd.merge(left = joinSellout,
                       right = promoData,
                       left_on=["REGIONID","PRODUCT"],
                       right_on = ["REGION", "PD"],
                       how="right")
mergeResult  # left 데이터는 무조건 살린다.

  REGIONID PRODUCT  YEARWEEK     QTY REGION      PD  PROMOTION
0      A01  ST0001  201901.0  3000.0    A01  ST0001        0.3
1      A01  ST0001  201902.0  3500.0    A01  ST0001        0.3
2      A02  ST0002  201901.0  4000.0    A02  ST0002        0.5
3      NaN     NaN       NaN     NaN    A99  ST0099        0.9

## outer join

In [37]:
mergeResult = pd.merge(left = joinSellout,
                       right = promoData,
                       left_on=["REGIONID","PRODUCT"],
                       right_on = ["REGION", "PD"],
                       how="outer")
mergeResult # 모든 데이터를 살린다

  REGIONID PRODUCT  YEARWEEK     QTY REGION      PD  PROMOTION
0      A01  ST0001  201901.0  3000.0    A01  ST0001        0.3
1      A01  ST0001  201902.0  3500.0    A01  ST0001        0.3
2      A02  ST0002  201901.0  4000.0    A02  ST0002        0.5
3      A02  ST0003  201902.0  7000.0    NaN     NaN        NaN
4      NaN     NaN       NaN     NaN    A99  ST0099        0.9

# 참고. 조인키 설정의 중요성

In [38]:
# 기본키와 외래키에 대한 개념을 잘 잡아야 한다.
# 조인키 설정 시, 다른 테이블의 기본키를 참조하지 않으면 데이터가 증폭될 수 있다는 것을 유념해야 한다.

## 조인키 오설정 예시 1

In [39]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [40]:
row1 = ["ST0001", "S23 MODEL"]
row2 = ["ST0002", "S22 MODEL"]
row3 = ["ST0003", "S21 MODEL"]

In [41]:
productData = pd.DataFrame( [row1, row2, row3], columns=["PRODUCT_CODE", "PRODUCT_ACTUAL_NAME"] )
productData

  PRODUCT_CODE PRODUCT_ACTUAL_NAME
0       ST0001           S23 MODEL
1       ST0002           S22 MODEL
2       ST0003           S21 MODEL

In [42]:
mergeResult = pd.merge(left = joinSellout,
                       right = productData,
                       left_on= "PRODUCT",
                       right_on = "PRODUCT_CODE",
                       how="inner")
mergeResult

  REGIONID PRODUCT  YEARWEEK   QTY PRODUCT_CODE PRODUCT_ACTUAL_NAME
0      A01  ST0001    201901  3000       ST0001           S23 MODEL
1      A01  ST0001    201902  3500       ST0001           S23 MODEL
2      A02  ST0002    201901  4000       ST0002           S22 MODEL
3      A02  ST0003    201902  7000       ST0003           S21 MODEL

In [43]:
row1 = ["ST0001", "S23 MODEL"]
row2 = ["ST0001", "S23 MODEL_1"] # CODE가 ST0001인 것에 대한 데이터가 중복된 상태이다.
row3 = ["ST0002", "S22 MODEL"]
row4 = ["ST0003", "S21 MODEL"]

In [44]:
wrongProductData = pd.DataFrame( [row1, row2, row3, row4], columns=["PRODUCT_CODE", "PRODUCT_ACTUAL_NAME"] )
wrongProductData

  PRODUCT_CODE PRODUCT_ACTUAL_NAME
0       ST0001           S23 MODEL
1       ST0001         S23 MODEL_1
2       ST0002           S22 MODEL
3       ST0003           S21 MODEL

In [45]:
mergeResult = pd.merge(left = joinSellout,
                       right = wrongProductData,
                       left_on= "PRODUCT",
                       right_on = "PRODUCT_CODE",
                       how="inner")
mergeResult  # 키를 오설정하여, 데이터가 증폭되었다.

  REGIONID PRODUCT  YEARWEEK   QTY PRODUCT_CODE PRODUCT_ACTUAL_NAME
0      A01  ST0001    201901  3000       ST0001           S23 MODEL
1      A01  ST0001    201901  3000       ST0001         S23 MODEL_1
2      A01  ST0001    201902  3500       ST0001           S23 MODEL
3      A01  ST0001    201902  3500       ST0001         S23 MODEL_1
4      A02  ST0002    201901  4000       ST0002           S22 MODEL
5      A02  ST0003    201902  7000       ST0003           S21 MODEL

## 조인키 오설정 예시 2

In [46]:
row1 = ["A02", "ST0001", 201901 , 2000]
row2 = ["A02", "ST0002", 201902 , 2000]
row3 = ["A02", "ST0003", 201901 , 2000]
row4 = ["A02", "ST0005", 201901 , 2000]

In [47]:
newData = pd.DataFrame( [row1, row2, row3, row4], columns = joinSellout.columns )
newData

  REGIONID PRODUCT  YEARWEEK   QTY
0      A02  ST0001    201901  2000
1      A02  ST0002    201902  2000
2      A02  ST0003    201901  2000
3      A02  ST0005    201901  2000

In [48]:
unionData = joinSellout.append(newData) # union 개념
unionData = unionData.reset_index(drop=True)
unionData

C:\Users\2an_d\AppData\Local\Temp\ipykernel_7044\1661070306.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  unionData = joinSellout.append(newData) # union 개념

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000
4      A02  ST0001    201901  2000
5      A02  ST0002    201902  2000
6      A02  ST0003    201901  2000
7      A02  ST0005    201901  2000

In [49]:
row1 = ["A01", "ST0001", 0.3]
row2 = ["A02", "ST0001", 0.5]
row3 = ["A02", "ST0002", 0.5]
row4 = ["A99", "ST0099", 0.9]
promoData = pd.DataFrame([row1, row2, row3, row4], columns=["REGION", "PD", "PROMOTION"])
promoData

  REGION      PD  PROMOTION
0    A01  ST0001        0.3
1    A02  ST0001        0.5
2    A02  ST0002        0.5
3    A99  ST0099        0.9

In [50]:
mergeResult = pd.merge(left = unionData,
                       right = promoData,
                       left_on= "PRODUCT",
                       right_on = "PD",
                       how="left")
mergeResult # 키를 오설정하여, 데이터가 증폭되었다.

   REGIONID PRODUCT  YEARWEEK   QTY REGION      PD  PROMOTION
0       A01  ST0001    201901  3000    A01  ST0001        0.3
1       A01  ST0001    201901  3000    A02  ST0001        0.5
2       A01  ST0001    201902  3500    A01  ST0001        0.3
3       A01  ST0001    201902  3500    A02  ST0001        0.5
4       A02  ST0002    201901  4000    A02  ST0002        0.5
5       A02  ST0003    201902  7000    NaN     NaN        NaN
6       A02  ST0001    201901  2000    A01  ST0001        0.3
7       A02  ST0001    201901  2000    A02  ST0001        0.5
8       A02  ST0002    201902  2000    A02  ST0002        0.5
9       A02  ST0003    201901  2000    NaN     NaN        NaN
10      A02  ST0005    201901  2000    NaN     NaN        NaN